---
kind: property
id: P:Autodesk.Revit.DB.ModelText.Depth
source: html/bad86923-c56f-a7c5-502d-b123b699c74b.htm
---
# Autodesk.Revit.DB.ModelText.Depth Property

The depth of the model text.

## Syntax (C#)
```csharp
public double Depth { get; set; }
```